Revit 2026 API

# ScheduleFilterFilterType Property

---

The filter type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ScheduleFilterType FilterType { get; set; }
```
```vb
Public Property FilterType As ScheduleFilterType
	Get
	Set
```
```cpp
public:
property ScheduleFilterType FilterType {
	ScheduleFilterType get ();
	void set (ScheduleFilterType value);
}
```
```fsharp
member FilterType : ScheduleFilterType with get, set
```

#### Property Value

ScheduleFilterType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See ScheduleFilterType for details.

#### Reference

ScheduleFilter Class

Autodesk.Revit.DB Namespace